Tekla Open API Reference for Tekla Structures 2025
Arc Properties
The Arc type exposes the following members.
Properties
Name | Description
Angle
 Gets angle of the arc in radians.
ArcMiddlePoint
 Gets the point located at the middle of the arc
CenterPoint
 Gets or sets center point of the arc.
EndPoint
 Gets or sets end point of the arc.
Length
 Returns the length of the arc
Normal
 Gets normal of the arc, which defines the axis of rotation of the radial vector pointing to the start point of the arc.
Radius
 Gets the radius of the arc.
StartDirection
 Gets the unit vector which points from the center point to the start point of the arc, which defines the X axis of the arc coordinate system.
StartPoint
 Gets or sets start point of the arc.
StartTangent
 Gets the unit vector tangent to the start point which defines the Y axis of the arc coordinate system
Top
See Also
Reference
Arc Class
Tekla.Structures.Geometry3d Namespace